input_openfoam/tutorials/multiphase/interFoam/laminar/waveMangroveInteraction/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform  0.0001;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.0001;
    }
}


// ************************************************************************* //
